LEXICON_COMMANDS = {
    'start': 'Начало работы с ботом',
    'help': 'Информация о командах',
    'register': 'Заполнить анкету',
    'showdata': 'Показать анкету',
    'drawing': 'Начать жеребьёвку'
}


LEXICON_RU = {
 'agree_button': 'го',
 'already_chosen': [],
 'begin_main_drawing': 'Ну что ж, наконец-то перейдём к жеребьёвке',
 'chosen_conditions_count': 'Отлично, теперь разошли всем гостям ключ,\n'
                            'они должны уже быть в режиме гостя жеребьёвки, '
                            'как только они введут ключ, то присоединятся\n'
                            'Напиши, пока внизу количество участников\n'
                            'Максимально, пока, 20',
 'chosen_genres_count': 'Отлично, так же количество условий от каждого игрока',
 'disagree': 'Ну и иди на хуй',
 'disagree_button': 'нет',
 'female': 'Женщина',
 'fill_genre_count': 'Выберите количество жанров от 1 до 3',
 'filled_age': 'Прекрасно, а теперь укажите свой пол',
 'filled_age_false': 'Выберите из предложенного\n'
                     'если не хотите заполнять анкету, нажмите на /cancel',
 'filled_gender': 'Отлично, а теперь загрузите своё фото',
 'filled_gender_false': 'Не, нажмите на кнопкуесли не хотите заполнять анкету, '
                        'нажмите на /cancel',
 'filled_name': 'Отлично, теперь введите свой возраст',
 'filled_name_false': 'Видимо вы ввели не имя или ввели его не корректно,\n'
                      'если не хотите заполнять анкету, нажмите на /cancel',
 'finally': 'В таком случае, тебе попался',
 'get_conditions': 'Вот условия',
 'get_conditions_button': 'Получить условия',
 'get_last_name': 'И кто тебе попался в прошлый раз ?',
 'get_own_name': 'Итак, в списке есть данные именна, кто вы?',
 'guest': 'Гость',
 'guest_begin': 'Отлично, введите ключ от инициатора жеребьёвки',
 'help': '/register - Заполнение анкеты, необходимо, чтобы использовать всю '
         'функциональность бота\n'
         '/showdata - Просмотреть свою анкету\n'
         '/read_fanfics - Прочитать существующие фанфики(появится позже)\n'
         '/drawing - Провести жеребьёвку, либо присоединиться к '
         'участникам(скоро)',
 'initiator': 'Инициатор',
 'key': 'ключ',
 'late_start': 'А всё, ты зашёл слишком далеко, чтоб начинать сначала',
 'male': 'Мужчина',
 'many_tries': 'Ты своё уже отгадал, пошёл нах',
 'names': ('Алихан', 'Андрэ', 'Даниил', 'Карин', 'Кейт', 'Ленар'),
 'no_key': 'Такого ключа нет',
 'now_wait': 'Отлично, терь подождите, после отбора начнётся жеребьёвка\n'
             'Вам придёт сообщение',
 'only_digits': 'Строка должна состоять из цифр',
 'other_messages': 'Я хуй его о чём ты, следуй кнопкам',
 'register': 'Прошу ввести имя, с заглавной буквы',
 'register_warning': 'Сначала зарегистрируйтесь, чтоб пользоваться ботом',
 'start': 'Здравствуйте, это бот для написания фанфиков и жеребьёвки среди '
          'участников\n'
          'Нажмите на /help, чтобы узнать подробную информацию\n'
          'Прежде чем пользоваться ботом, пройдите регистрацию, нажав на '
          'команду /register',
 'start_drawing': 'Вы вошли в режим жеребьёвки,\nУкажите, кем вы являетесь',
 'start_false': 'Вы уже нажимали на /start и прошли регистрацию',
 'stop_recruitment': 'Нажмите, когда захотите закончить набор,\n'
                     'Пользователей в комнате: ',
 'stop_recruitment_button': 'Закончить набор',
 'undefined_gender': 'Из этих',
 'uploaded_photo': 'Спасибо, анкета готова, нажмите на /showdata, чтобы её '
                   'увидеть',
 'uploaded_photo_fail': 'Загрузите именно фотоесли не хотите заполнять анкету, '
                        'нажмите на /cancel',
 'wait_for_conditions': 'Ну всо, жди пока все напишут свои условия\n'
                        'Периодически нажимай на кнопки получения условий, '
                        'чтоб чекнуть\n'
                        'Мог бы и сам предупредить, но это ещё 100 строк кода '
                        'писать надо, мне лень'}
