LEXICON_RU = {'/start': 'Здаров, это бот по жеребьёвке людишек из суесайда, ну шо, погнали ?',
              'agree_button': 'го',
              'disagree_button': 'нет',
              'disagree': 'Ну и иди на хуй',
              'get_own_name': 'Итак, в списке есть данные именна, кто вы?',
              'get_last_name': 'И кто тебе попался в прошлый раз ?',
              'names': ('Алихан', 'Андрэ', 'Даниил', 'Карин', 'Кейт', 'Ленар'),
              'already_chosen': [],
              'other_messages': 'Я хуй его о чём ты, следуй кнопкам',
              'Many_tries': 'Ты своё уже отгадал, пошёл нах',
              'finally': 'В таком случае, тебе попался',
              'late_start': 'А всё, ты зашёл слишком далеко, чтоб начинать сначала',
              'get_conditions_button': 'Получить условия',
              'get_conditions': 'Вот условия',
              'wait_for_conditions': 'Ну всо, жди пока все напишут свои условия\n'
                                     'Периодически нажимай на кнопки получения условий, чтоб чекнуть\n'
                                     'Мог бы и сам предупредить, но это ещё 100 строк кода писать надо, мне лень',}
