LEXICON_RU = {'start': 'Здравствуйте, это бот для написания фанфиков и жеребьёвки среди участников\n'
                        'Нажмите на /help, чтобы узнать подробную информацию\n'
                        'Прежде чем пользоваться ботом, пройдите регистрацию, нажав на команду /register',
              'start_false': 'Вы уже нажимали на /start и прошли регистрацию',
              'help': '/register - Заполнение анкеты, необходимо, чтобы использовать всю функциональность бота'
                      '/showdata - Просмотреть свою анкету'
                      '/read_fanfics - Прочитать существующие фанфики(появится позже)'
                      '/player_draw - Провести жеребьёвку, либо присоединиться к участникам(скоро)',
              'register': 'Прошу ввести имя, с заглавной буквы',
              'filled_name': 'Отлично, теперь введите свой возраст',
              'filled_name_false': 'Видимо вы ввели не имя или ввели его не корректно,\n'
                                   'если не хотите заполнять анкету, нажмите на /cancel',
              'filled_age': 'Прекрасно, а теперь укажите свой пол',
              'filled_age_false': 'Выберите из предложенного\n'
                                  'если не хотите заполнять анкету, нажмите на /cancel',
              'male': 'Мужчина',
              'female': 'Женщина',
              'undefined_gender': 'Из этих',
              'filled_gender': 'Отлично, а теперь загрузите своё фото',
              'filled_gender_false': 'Не, загрузите именно фото\n'
                                     'если не хотите заполнять анкету, нажмите на /cancel',
              'uploaded_photo': 'Спасибо, анкета готова, нажмите на /showdata, чтобы её увидеть',
              'agree_button': 'го',
              'disagree_button': 'нет',
              'disagree': 'Ну и иди на хуй',
              'get_own_name': 'Итак, в списке есть данные именна, кто вы?',
              'get_last_name': 'И кто тебе попался в прошлый раз ?',
              'names': ('Алихан', 'Андрэ', 'Даниил', 'Карин', 'Кейт', 'Ленар'),
              'already_chosen': [],
              'other_messages': 'Я хуй его о чём ты, следуй кнопкам',
              'Many_tries': 'Ты своё уже отгадал, пошёл нах',
              'finally': 'В таком случае, тебе попался',
              'late_start': 'А всё, ты зашёл слишком далеко, чтоб начинать сначала',
              'get_conditions_button': 'Получить условия',
              'get_conditions': 'Вот условия',
              'wait_for_conditions': 'Ну всо, жди пока все напишут свои условия\n'
                                     'Периодически нажимай на кнопки получения условий, чтоб чекнуть\n'
                                     'Мог бы и сам предупредить, но это ещё 100 строк кода писать надо, мне лень'}

LEXICON_COMMANDS = {
    'start': 'Начало работы с ботом',
    'help': 'Информация о командах',
    'register': 'Заполнить анкету',
    'showdata': 'Показать анкету',
}
